###cidrhost Function
#cidrhost calculates a full host IP address for a given host number within a given IP network address prefix.
cidrhost(prefix, hostnum)
Examples
> cidrhost("10.12.127.0/20", 16)
10.12.112.16
> cidrhost("10.12.127.0/20", 268)
10.12.113.12
> cidrhost("fd00:fd12:3456:7890:00a2::/72", 34)
fd00:fd12:3456:7890::22

###cidrnetmask Function
#cidrnetmask converts an IPv4 address prefix given in CIDR notation into a subnet mask address.
cidrnetmask(prefix)
Examples
> cidrnetmask("172.16.0.0/12")
255.240.0.0

###cidrsubnet Function
#cidrsubnet calculates a subnet address within given IP network address prefix.
cidrsubnet(prefix, newbits, netnum)
Examples
> cidrsubnet("172.16.0.0/12", 4, 2)
172.18.0.0/16
> cidrsubnet("10.1.2.0/24", 4, 15)
10.1.2.240/28
> cidrsubnet("fd00:fd12:3456:7890::/56", 16, 162)
fd00:fd12:3456:7800:a200::/72

###cidrsubnets Function
#cidrsubnets calculates a sequence of consecutive IP address ranges within a particular CIDR prefix
cidrsubnets(prefix, newbits...)
Examples
> cidrsubnets("10.1.0.0/16", 4, 4, 8, 4)
[
  "10.1.0.0/20",
  "10.1.16.0/20",
  "10.1.32.0/24",
  "10.1.48.0/20",
]

> cidrsubnets("fd00:fd12:3456:7890::/56", 16, 16, 16, 32)
[
  "fd00:fd12:3456:7800::/72",
  "fd00:fd12:3456:7800:100::/72",
  "fd00:fd12:3456:7800:200::/72",
  "fd00:fd12:3456:7800:300::/88",
]
#You can use nested cidrsubnets calls with for expressions to concisely allocate groups of network address blocks:
> [for cidr_block in cidrsubnets("10.0.0.0/8", 8, 8, 8, 8) : cidrsubnets(cidr_block, 4, 4)]
[
  [
    "10.0.0.0/20",
    "10.0.16.0/20",
  ],
  [
    "10.1.0.0/20",
    "10.1.16.0/20",
  ],
  [
    "10.2.0.0/20",
    "10.2.16.0/20",
  ],
  [
    "10.3.0.0/20",
    "10.3.16.0/20",
  ],
]
